#Задача 1

In [3]: x = (2 + 2 * 2 - 2)/2 #вариант решения 1

In [4]: print(x)
2.0

In [3]: x = (2 + 2 * 2 - 2)/2 #вариант решения 2

In [4]: print(x)
2.0


#Задача 3
In [40]: list_simvol = ["2", "b", "9", "k"] # создан список

n [41]: print(" ".join(list_simvol)) # преобразовли список в строку

In [43]: print(" ".join(list_simvol))[::-1] # инвертировали строку


#Задача 2

In [80]: x = 2130

In [81]: y = 0.1

In [82]: z = 120

In [83]: d = x*y+x+z # сумма за первый год

In [84]: c = d*y+d+z # сумма за второй год

In [85]: f = c*y+c+z # сумма за третий год

In [86]: g = f*y+f+z # сумма за четвёртый год

In [87]: h = g*y+g+z # сумма за пятый год


In [89]: print(h)
4162.9983

